fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_Отпуска</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазностьДат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчестьБольшойОтпуск</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	РазностьДат();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	РазностьДат();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)
	РазностьДат();
	//Проверить сумму дней
	СоответсвиеСтрудникаИДней = Новый Соответствие();
	
	Для Каждого Строка из Объект.ОтпускаСотрудников Цикл
		Сотрудник = Строка.Сотрудник;
		ЧислоДней = Строка.РазностьДат;
		Если СоответсвиеСтрудникаИДней.Получить(Сотрудник) = Неопределено Тогда
			СоответсвиеСтрудникаИДней.Вставить(Сотрудник, ЧислоДней);	
		Иначе
			СоответсвиеСтрудникаИДней[Сотрудник] = СоответсвиеСтрудникаИДней[Сотрудник] + ЧислоДней;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Элемент Из СоответсвиеСтрудникаИДней Цикл
		
		Для Каждого Строка из Объект.ОтпускаСотрудников Цикл
			
			Если Элемент.Значение > 28 Тогда
				Если Строка.Сотрудник = Элемент.Ключ Тогда
					Строка.УчестьБольшойОтпуск = Истина;		
				КонецЕсли;	
			Иначе
				Если Строка.Сотрудник = Элемент.Ключ Тогда
					Строка.УчестьБольшойОтпуск = Ложь;		
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыДляАнализа = АнализГрафикаНаСервере();
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыДляАнализа, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РазностьДат()
	
	СтрокаТабличнойЧасти = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.ДатаОкончания < СтрокаТабличнойЧасти.ДатаНачала Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания меньше даты начала отпуска");	
		Возврат;
	КонецЕсли;
	СтрокаТабличнойЧасти.РазностьДат = ((НачалоДня(СтрокаТабличнойЧасти.ВКМ_ДатаОкончания) - НачалоДня(СтрокаТабличнойЧасти.ВКМ_ДатаНачала)) / (60 * 60 * 24)) + 1;

КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
    ДанныеДляПередачи = Новый Структура;
    ДанныеДляПередачи.Вставить("Год", Объект.Год);
    ДанныеДляПередачи.Вставить("Отпуска", Объект.ОтпускаСотрудников.Выгрузить());
	
    АдресХранилища = ПоместитьВоВременноеХранилище(ДанныеДляПередачи, Объект);
	
    ПараметрыДляАнализа = Новый Структура("АдресХранилища", АдресХранилища);
	
    Возврат ПараметрыДляАнализа;
    
КонецФункции

#КонецОбласти
